web/mainblog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-29 Mon 10:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Main Blog</title>
<meta name="author" content="Rylan Lens Kellogg" />
<meta name="description" content="A blog for all things Lens_r." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Main Blog</h1>

<div id="outline-container-whatsaprogram" class="outline-2">
<h2 id="whatsaprogram">What <i>is</i> a Program?</h2>
<div class="outline-text-2" id="text-whatsaprogram">
<p>
This may seem obvious, but it turns out to be quite &#x2026; complex.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-keyword">return</span> 69;
}
</pre>
</div>

<p>
Is the above code a "program"? Most will say yes, in my experience. This immediately throws a wrench into most <i>obvious</i> definitions of program.
</p>

<p>
The code above is not executable; it's simply plain-text within a file. Well, then maybe a program <i>isn't</i> necessarily executable, but <i>some</i> programs <i>may</i> be executed. So "something executable on a computer" isn't really a valid definition of "program".
</p>

<p>
Some, from here, may expand the definition to "something that may be eventually executable on a computer (after some set of transformations)". Another issue arises, however, if we look at the following example.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-keyword">return</span> 69
}
</pre>
</div>

<p>
Is the above code a "program"? If we follow the "eventually executable" definition, it <i>isn't</i>. There is a syntax error, as the <code>return</code> statement is not terminated with a semi-colon. This code, therefore, isn't compileable; it's an "ill-formed program" according to the C standard. So, as we can see, some programs (without changing the source) are not <b>ever</b> executable.
</p>
</div>

<div id="outline-container-orge57b748" class="outline-3">
<h3 id="orge57b748"><span class="todo TODO">TODO</span> Etymology of "program"</h3>
<div class="outline-text-3" id="text-orge57b748">
<p>
Where did the word come from? Why do we use it to describe computery things?
</p>
</div>
</div>

<div id="outline-container-org135024b" class="outline-3">
<h3 id="org135024b"><b>My</b> Definition of "program"</h3>
<div class="outline-text-3" id="text-org135024b">
<p>
To me, there <i>isn't</i> a clear-cut definition of program. No matter which one you choose, there are unintuitive corner-cases. However! That does not stop me from <i>choosing</i> a definition that I am comfortable with.
</p>

<p>
What if "program" actually equates to "instructions that tell a computer to do computations". While this <i>is</i> incredibly vague, it is also just specific enough. For example, when you write C code, you are attempting to instruct the computer on how to do execution/computation in order to give you the result you want. And when you compile that C code into an executable, the executable also contains instructions that tells a computer how to do computations, just in a different format.
</p>

<p>
As with every definition of program, there are imperfect corner cases, but this is one I'm okay with: the <i>source code</i> and the <i>executable produced from that source code</i> are entirely separate programs that happen to have instructions within them that produce the same result (assuming a well-written compiler).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><small>Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6)</small></p>
</div>
</body>
</html>